In [1]:
import pandas as pd

In [2]:
data={
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Math': [85, 92, 78, 90],
    'Science': [88, 79, 95, 80],
    'English': [90, 85, 88, 92]
}

In [3]:
df = pd.DataFrame(data)
display(df)

    Name  Math  Science  English
0   John    85       88       90
1   Anna    92       79       85
2  Peter    78       95       88
3  Linda    90       80       92

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Math     4 non-null      int64
 2   Science  4 non-null      int64
 3   English  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

## Try various function

In [6]:
subjects=df.columns[1:]
subjects

Index(['Math', 'Science', 'English'], dtype='object')

In [7]:
for subject in subjects:
    print(subject)
    print(df[subject])
    print(f'Mean of {subject}: {df[subject].mean()}')

Math
0    85
1    92
2    78
3    90
Name: Math, dtype: int64
Mean of Math: 86.25
Science
0    88
1    79
2    95
3    80
Name: Science, dtype: int64
Mean of Science: 85.5
English
0    90
1    85
2    88
3    92
Name: English, dtype: int64
Mean of English: 88.75

In [13]:
import numpy as np

df['History'] = [99, np.nan, 85, 87]

In [9]:
display(df)

    Name  Math  Science  English  History
0   John    85       88       90     99.0
1   Anna    92       79       85      NaN
2  Peter    78       95       88     85.0
3  Linda    90       80       92     87.0

In [ ]:
df.isna() #결측치가 있는지 확인

    Name   Math  Science  English  History
0  False  False    False    False    False
1  False  False    False    False     True
2  False  False    False    False    False
3  False  False    False    False    False

In [11]:
df.isna().sum() #과목별 결측치 개수 확인

Name       0
Math       0
Science    0
English    0
History    1
dtype: int64

In [17]:
df['History'].fillna(0, inplace=True)  # 결측치를 0으로 대체 
display(df)

    Name  Math  Science  English  History
0   John    85       88       90     99.0
1   Anna    92       79       85      0.0
2  Peter    78       95       88     85.0
3  Linda    90       80       92     87.0

In [14]:
df['History'].fillna(0)  # 결측치를 0으로 대체

0    99.0
1     0.0
2    85.0
3    87.0
Name: History, dtype: float64

In [ ]:
df #원본 데이터프레임은 변경되지 않음 그래서 inplace=True 옵션을 사용해야 함

    Name  Math  Science  English  History
0   John    85       88       90     99.0
1   Anna    92       79       85      NaN
2  Peter    78       95       88     85.0
3  Linda    90       80       92     87.0

In [18]:
df['History'] = df['History'].astype('int64')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Math     4 non-null      int64
 2   Science  4 non-null      int64
 3   English  4 non-null      int64
 4   History  4 non-null      int64
dtypes: int64(4), object(1)
memory usage: 288.0+ bytes

In [19]:
subjects = df.columns[1:]

In [20]:
display(df)

    Name  Math  Science  English  History
0   John    85       88       90       99
1   Anna    92       79       85        0
2  Peter    78       95       88       85
3  Linda    90       80       92       87

In [21]:
df.describe() #기본 통계량 확인

            Math    Science    English    History
count   4.000000   4.000000   4.000000   4.000000
mean   86.250000  85.500000  88.750000  67.750000
std     6.238322   7.505553   2.986079  45.587827
min    78.000000  79.000000  85.000000   0.000000
25%    83.250000  79.750000  87.250000  63.750000
50%    87.500000  84.000000  89.000000  86.000000
75%    90.500000  89.750000  90.500000  90.000000
max    92.000000  95.000000  92.000000  99.000000

In [22]:
df['Math'].max()

92

In [23]:
df['Math'].idxmax()  #최댓값의 인덱스 반환

1

In [ ]:
df.loc[df['Math'].idxmax()] #최댓값을 가진 행 반환

Name       Anna
Math         92
Science      79
English      85
History       0
Name: 1, dtype: object

In [25]:
df[subjects].mean(axis=1)  #각 학생별 평균 점수 계산

0    90.50
1    64.00
2    86.50
3    87.25
dtype: float64

In [26]:
df[subjects].mean(axis=0)  #과목별 평균 점수 계산

Math       86.25
Science    85.50
English    88.75
History    67.75
dtype: float64

In [ ]:
df['Average'] = df[subjects].mean(axis=1) #각 학생별 평균 점수를 새로운 열로 추가
display(df)

    Name  Math  Science  English  History  Average
0   John    85       88       90       99    90.50
1   Anna    92       79       85        0    64.00
2  Peter    78       95       88       85    86.50
3  Linda    90       80       92       87    87.25

In [28]:
df[subjects].mean()  #각 과목별 평균 점수

Math       86.25
Science    85.50
English    88.75
History    67.75
dtype: float64

In [29]:
df.sort_values(by='Average', ascending=False) #평균 점수를 기준으로 내림차순 정렬

    Name  Math  Science  English  History  Average
0   John    85       88       90       99    90.50
3  Linda    90       80       92       87    87.25
2  Peter    78       95       88       85    86.50
1   Anna    92       79       85        0    64.00

In [ ]:
df[df['Math']>80] #수학 점수가 80점 초과인 학생들

    Name  Math  Science  English  History  Average
0   John    85       88       90       99    90.50
1   Anna    92       79       85        0    64.00
3  Linda    90       80       92       87    87.25

In [33]:
df[(df['Math']>80) & (df['English']>90)] #수학 점수가 80점 초과이고 영어 점수가 80점 초과인 학생들

    Name  Math  Science  English  History  Average
3  Linda    90       80       92       87    87.25

## 2

## import data

In [49]:
import pandas as pd
import os

players_path = '/Users/choedasom/Desktop/ds/Data/players.csv'

players = pd.read_csv(players_path)

In [55]:
import os
import pandas as pd

p = '/Users/choedasom/Desktop/ds/Data/player_valuations.csv'  # 실제 파일명 확인됨
print("exists:", os.path.exists(p))

players_valuation = pd.read_csv(p, encoding='utf-8')
print(players_valuation.shape)
players_valuation.head()

exists: True
(430460, 9)

,player_id,last_season,datetime,date,dateweek,market_value_in_eur,n,current_club_id,player_club_domestic_competition_id
0,3132,2013,2003-12-09 00:00:00,2003-12-09,2003-12-08,400000,1,126,TR1
1,6893,2012,2003-12-15 00:00:00,2003-12-15,2003-12-15,900000,1,984,GB1
2,10,2015,2004-10-04 00:00:00,2004-10-04,2004-10-04,7000000,1,398,IT1
3,26,2017,2004-10-04 00:00:00,2004-10-04,2004-10-04,1500000,1,16,L1
4,65,2015,2004-10-04 00:00:00,2004-10-04,2004-10-04,8000000,1,1091,GR1

In [74]:
import os
import pandas as pd

# 정확한 절대경로와 파일명 확인
path = '/Users/choedasom/Desktop/ds/Data/player_valuations.csv'
print(os.path.exists(path))  # True 여야 함

players_valuations = pd.read_csv(path, encoding='utf-8')

True

## dataset information

In [58]:
print(players.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28476 entries, 0 to 28475
Data columns (total 23 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   player_id                             28476 non-null  int64
 1   first_name                            26627 non-null  object
 2   last_name                             28476 non-null  object
 3   name                                  28476 non-null  object
 4   last_season                           28476 non-null  int64
 5   current_club_id                       28476 non-null  int64
 6   player_code                           28476 non-null  object
 7   country_of_birth                      26684 non-null  object
 8   city_of_birth                         26694 non-null  object
 9   country_of_citizenship                28475 non-null  object
 10  date_of_birth                         28434 non-null  object
 11  sub_position                          28317 non-null  object
 12  position                              28476 non-null  object
 13  foot                                  26401 non-null  object
 14  height_in_cm                          26758 non-null  float64
 15  market_value_in_eur                   17982 non-null  float64
 16  highest_market_value_in_eur           27481 non-null  float64
 17  contract_expiration_date              17975 non-null  object
 18  agent_name                            13992 non-null  object
 19  image_url                             28476 non-null  object
 20  url                                   28476 non-null  object
 21  current_club_domestic_competition_id  28476 non-null  object
 22  current_club_name                     28476 non-null  object
dtypes: float64(3), int64(3), object(17)
memory usage: 5.0+ MB
None

In [75]:
print(players_valuations.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 430460 entries, 0 to 430459
Data columns (total 9 columns):
 #   Column                               Non-Null Count   Dtype
---  ------                               --------------   -----
 0   player_id                            430460 non-null  int64
 1   last_season                          430460 non-null  int64
 2   datetime                             430460 non-null  object
 3   date                                 430460 non-null  object
 4   dateweek                             430460 non-null  object
 5   market_value_in_eur                  430460 non-null  int64
 6   n                                    430460 non-null  int64
 7   current_club_id                      430460 non-null  int64
 8   player_club_domestic_competition_id  430460 non-null  object
dtypes: int64(5), object(4)
memory usage: 29.6+ MB
None

In [76]:
display(players.head())
display(players_valuations.head())

,player_id,first_name,last_name,name,last_season,current_club_id,player_code,country_of_birth,city_of_birth,country_of_citizenship,date_of_birth,sub_position,position
0,597,Aleksandr,Hleb,Aleksandr Hleb,2016,2696,aleksandr-hleb,UdSSR,Minsk,Belarus,1981-05-01,Attacking Midfield,Midfield
1,1428,Mike,Hanke,Mike Hanke,2013,60,mike-hanke,Germany,Hamm,Germany,1983-11-05,Centre-Forward,Attack
2,1560,Youssef,El Akchaoui,Youssef El Akchaoui,2012,306,youssef-el-akchaoui,Netherlands,Dordrecht,Morocco,1981-02-18,Left-Back,Defender
4,1726,Heiko,Westermann,Heiko Westermann,2016,610,heiko-westermann,Germany,Alzenau,Germany,1983-08-14,Centre-Back,Defender
5,2306,Markus,Miller,Markus Miller,2014,42,markus-miller,Germany,Lindenberg im Allgäu,Germany,1982-04-08,Goalkeeper,Goalkeeper

,player_id,last_season,datetime,date,dateweek,market_value_in_eur,n,current_club_id,player_club_domestic_competition_id
0,3132,2013,2003-12-09 00:00:00,2003-12-09,2003-12-08,400000,1,126,TR1
1,6893,2012,2003-12-15 00:00:00,2003-12-15,2003-12-15,900000,1,984,GB1
2,10,2015,2004-10-04 00:00:00,2004-10-04,2004-10-04,7000000,1,398,IT1
3,26,2017,2004-10-04 00:00:00,2004-10-04,2004-10-04,1500000,1,16,L1
4,65,2015,2004-10-04 00:00:00,2004-10-04,2004-10-04,8000000,1,1091,GR1

In [77]:
print(players_valuations.columns)
print(players.columns)

Index(['player_id', 'last_season', 'datetime', 'date', 'dateweek',
       'market_value_in_eur', 'n', 'current_club_id',
       'player_club_domestic_competition_id'],
      dtype='object')
Index(['player_id', 'first_name', 'last_name', 'name', 'last_season',
       'current_club_id', 'player_code', 'country_of_birth', 'city_of_birth',
       'country_of_citizenship', 'date_of_birth', 'sub_position', 'position'],
      dtype='object')

In [62]:
columns =[ 
    'player_id','first_name','last_name','name','last_season','current_club_id','player_code',
    'country_of_birth','city_of_birth','country_of_citizenship','date_of_birth','sub_position','position']

players = players[columns]

In [78]:
print(players.isna().sum(), '\n') # 각 열의 결측치 개수 출력
print(players_valuations.isna().sum()) # 각 열의 결측치 개수 출력

player_id                 0
first_name                0
last_name                 0
name                      0
last_season               0
current_club_id           0
player_code               0
country_of_birth          0
city_of_birth             0
country_of_citizenship    0
date_of_birth             0
sub_position              0
position                  0
dtype: int64

player_id                              0
last_season                            0
datetime                               0
date                                   0
dateweek                               0
market_value_in_eur                    0
n                                      0
current_club_id                        0
player_club_domestic_competition_id    0
dtype: int64

In [64]:
players[players['country_of_citizenship'].isna()] # 결측치가 있는 행 반환

,player_id,first_name,last_name,name,last_season,current_club_id,player_code,country_of_birth,city_of_birth,country_of_citizenship,date_of_birth,sub_position,position
21764,345068,Abdullah,Karakoc,Abdullah Karakoc,2014,3216,abdullah-karakoc,Germany,Köln,NaN,NaN,Centre-Back,Defender

In [66]:
players[players['date_of_birth'].isna()].head() # 결측치가 있는 행 반환

,player_id,first_name,last_name,name,last_season,current_club_id,player_code,country_of_birth,city_of_birth,country_of_citizenship,date_of_birth,sub_position,position
3,1587,Mario,Eggimann,Mario Eggimann,2012,42,mario-eggimann,Switzerland,Brugg,Switzerland,NaN,Centre-Back,Defender
17,3942,Martin,Lanig,Martin Lanig,2014,24,martin-lanig,Germany,Bad Mergentheim,Germany,NaN,Defensive Midfield,Midfield
2068,58124,Julian,Schieber,Julian Schieber,2020,167,julian-schieber,Germany,Backnang,Germany,NaN,Centre-Forward,Attack
2152,83188,Marc,Lais,Marc Lais,2012,60,marc-lais,Germany,Freiburg im Breisgau,Germany,NaN,Defensive Midfield,Midfield
2236,116272,Benedikt,Röcker,Benedikt Röcker,2018,206,benedikt-rocker,Germany,Bietigheim-Bissingen,Germany,NaN,Centre-Back,Defender

In [67]:
players.dropna(inplace=True) # 결측치가 있는 행 제거
print(players.isna().sum()) # 모든 열의 결측치 개수가 0인지 확인

player_id                 0
first_name                0
last_name                 0
name                      0
last_season               0
current_club_id           0
player_code               0
country_of_birth          0
city_of_birth             0
country_of_citizenship    0
date_of_birth             0
sub_position              0
position                  0
dtype: int64

## descriptive statistics

In [ ]:
def count_value(df, column): 
    count = len(df[column].unique())
    print(f'total {column}: {count}')

columns=['player_id','current_club_id','country_of_citizenship']
for col in columns:
    count_value(players, col)

total player_id: 24785
total current_club_id: 409
total country_of_citizenship: 180

In [ ]:
players_valuations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 430460 entries, 0 to 430459
Data columns (total 9 columns):
 #   Column                               Non-Null Count   Dtype
---  ------                               --------------   -----
 0   player_id                            430460 non-null  int64
 1   last_season                          430460 non-null  int64
 2   datetime                             430460 non-null  object
 3   date                                 430460 non-null  object
 4   dateweek                             430460 non-null  object
 5   market_value_in_eur                  430460 non-null  int64
 6   n                                    430460 non-null  int64
 7   current_club_id                      430460 non-null  int64
 8   player_club_domestic_competition_id  430460 non-null  object
dtypes: int64(5), object(4)
memory usage: 29.6+ MB

In [81]:
players_valuations['market_value_in_eur'].describe()

count    4.304600e+05
mean     2.387296e+06
std      6.655655e+06
min      1.000000e+04
25%      2.000000e+05
50%      5.000000e+05
75%      1.600000e+06
max      2.000000e+08
Name: market_value_in_eur, dtype: float64

In [82]:
pd.options.display.float_format = '{:.3f}'.format # 소수점 3자리로 표시
players_valuations['market_value_in_eur'].describe()

count      430460.000
mean      2387295.721
std       6655655.453
min         10000.000
25%        200000.000
50%        500000.000
75%       1600000.000
max     200000000.000
Name: market_value_in_eur, dtype: float64

In [88]:
mean= players_valuations['market_value_in_eur'].mean() # 평균 계산
over_mean= len(players_valuations[players_valuations['market_value_in_eur'] > mean])
total = len(players_valuations)
print(f'market_value_in_eur 평균 초과 선수 비율: {over_mean/total*100:.2f}%')

market_value_in_eur 평균 초과 선수 비율: 20.11%